cask_args appdir: '/Applications'

tap 'golangci/tap', trusted: true
tap 'hashicorp/tap', trusted: true
tap 'kdash-rs/kdash', trusted: true
tap 'lingrino/tap', trusted: true
tap 'modem-dev/tap', trusted: true
tap 'terraform-linters/tap', trusted: true

brew 'atlas'
brew 'atuin'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bind'
brew 'bottom'
brew 'bun'
brew 'chezmoi'
brew 'cloudflare-wrangler'
brew 'coreutils'
brew 'doggo'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fnm'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'golangci/tap/golangci-lint'
brew 'googleworkspace-cli'
brew 'goreleaser'
brew 'govulncheck'
brew 'gping'
brew 'hadolint'
brew 'hashicorp/tap/terraform'
brew 'helm'
brew 'jq'
brew 'just'
brew 'kdash-rs/kdash/kdash'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'less'
brew 'libgit2'
brew 'markdownlint-cli'
brew 'mas'
brew 'modem-dev/tap/hunk'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pandoc'
brew 'procs'
brew 'python'
brew 'readline'
brew 'ripgrep'
brew 'rustup'
brew 'scc'
brew 'sd'
brew 'shellcheck'
brew 'shfmt'
brew 'sqlite'
brew 'terraform-ls'
brew 'trafilatura'
brew 'tree'
brew 'ty'
brew 'uv'
brew 'viddy'
brew 'watch'
brew 'weasyprint'
brew 'wget'
brew 'yq'
brew 'yt-dlp'
brew 'zoxide'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'cleanshot'
cask 'codex'
cask 'codex-app'
cask 'copilot-money'
cask 'cursor'
cask 'ghostty'
cask 'google-chrome'
cask 'headlamp'
cask 'itsycal'
cask 'lingrino/tap/agent-archiver'
cask 'lingrino/tap/glen'
cask 'lingrino/tap/vaku'
cask 'loom'
cask 'macwhisper'
cask 'medis'
cask 'mimestream'
cask 'multitouch'
cask 'orbstack'
cask 'proxyman'
cask 'slack'
cask 'tableplus'
cask 'tailscale-app'
cask 'terraform-linters/tap/tflint'
cask 'vlc'
cask 'zed'
cask 'zoom'

mas 'Peek', id: 1554235898
mas 'Remote Desktop', id: 409907375
mas 'Screens 5', id: 1663047912
mas 'Things', id: 904280696
