cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "caskroom/versions"

brew 'ack'
brew 'autojump'
brew 'coreutils'
brew 'ctags'
brew 'git'
brew 'go'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'libgit2'
brew 'nmap'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'readline'
brew 'packer'
brew 'postgresql'
brew 'python'
brew 'shellcheck'
brew 'terraform'
brew 'unrar'
brew 'vault'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

cask 'alfred'
cask 'docker'
cask 'caskroom/versions/google-chrome-beta'
cask 'hipchat'
cask 'caskroom/versions/iterm2-beta'
cask 'java'
cask 'caskroom/versions/skype-preview'
cask 'caskroom/versions/slack-beta'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'caskroom/versions/visual-studio-code-insiders'
cask 'vlc'
