cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'

brew 'ack'
brew 'coreutils'
brew 'ctags'
brew 'dep'
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'go'
brew 'goreleaser'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'libgit2'
brew 'nmap'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'readline'
brew 'packer'
brew 'postgresql'
brew 'python'
brew 'shellcheck'
brew 'terraform'
brew 'unrar'
brew 'vault'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'docker'
cask 'homebrew/cask-versions/google-chrome-beta'
cask 'hipchat'
cask 'homebrew/cask-versions/iterm2-beta'
cask 'java'
cask 'homebrew/cask-versions/skype-preview'
cask 'homebrew/cask-versions/slack-beta'
cask 'spotify'
cask 'sublime-text'
cask 'homebrew/cask-versions/visual-studio-code-insiders'
cask 'vlc'
